Pason-prsn/Project-Birdnest---ESP32-Controller/src/src/tx_main.cpp
  return true;
}

static void setupBindingFromConfig()
{
  if (firmwareOptions.hasUID)
  {
      memcpy(UID, firmwareOptions.uid, UID_LEN);
  }
  else
  {
#ifdef PLATFORM_ESP32
    esp_read_mac(UID, ESP_MAC_WIFI_STA);
#elif PLATFORM_STM32
    UID[0] = (uint8_t)HAL_GetUIDw0();
    UID[1] = (uint8_t)(HAL_GetUIDw0() >> 8);
    UID[2] = (uint8_t)HAL_GetUIDw1();
    UID[3] = (uint8_t)(HAL_GetUIDw1() >> 8);
    UID[4] = (uint8_t)HAL_GetUIDw2();
    UID[5] = (uint8_t)(HAL_GetUIDw2() >> 8);
#endif
  }

  DBGLN("UID=(%d, %d, %d, %d, %d, %d)",
    UID[0], UID[1], UID[2], UID[3], UID[4], UID[5]);

  OtaUpdateCrcInitFromUid();
}


static void cyclePower()
{
  // Only change power if we are running normally
  if (connectionState < MODE_STATES)
  {
    PowerLevels_e curr = POWERMGNT::currPower();
    if (curr == POWERMGNT::getMaxPower())
    {
      POWERMGNT::setPower(POWERMGNT::getMinPower());
    }
    else
    {
      POWERMGNT::incPower();
    }
  }
}

void UpdateChannelsFromPotentiometer()
{
  // Read potentiometer and joystick values (0-4095 on ESP32)
  int potValue = analogRead(THROTTLE_POT_PIN);
  int joystickX = analogRead(JOYSTICK_X_PIN);  // X-axis for yaw
  int joystickY = analogRead(JOYSTICK_Y_PIN);  // Y-axis for pitch
  
  // Read AUX1 switch (digital input, HIGH = armed, LOW = disarmed)
  bool aux1Switch = digitalRead(AUX1_SWITCH_PIN);
  
  // Map potentiometer value to CRSF range for throttle (172-1811)
  uint32_t throttleValue = map(potValue, 0, 4095, 172, 1811);

  int JOYSTICK_MIDDLE = 2047; // Middle value for joystick (0-4095 range)
  int JOYSTICK_DEADZONE = 300; // Deadzone for joystick input
  int JOYSTICK_DAMPING = 300; // Damping for joystick input

  uint32_t yawValue = CRSF_CHANNEL_VALUE_MID;
  if (abs(joystickX - JOYSTICK_MIDDLE) > JOYSTICK_DEADZONE) {
    yawValue = map(joystickX, 0, 4095, 1811-JOYSTICK_DAMPING+100, 172+JOYSTICK_DAMPING-100);    // X-axis controls yaw (inverted)
  }

  uint32_t pitchValue = CRSF_CHANNEL_VALUE_MID;
  if (abs(joystickY - JOYSTICK_MIDDLE) > JOYSTICK_DEADZONE) {
    pitchValue = map(joystickY, 0, 4095, 1811-JOYSTICK_DAMPING, 172+JOYSTICK_DAMPING);  // Y-axis controls pitch (inverted)
  }

  // Roll control from gyro Y-axis (continuous)
  uint32_t rollValue = CRSF_CHANNEL_VALUE_MID; // Default to center
  if (mpu6050Initialized) {
    int16_t currentGyroY = readMPU6050GyroY();
    int16_t gyroDelta = currentGyroY - gyroYOffset;
    
    // Map gyro delta to roll channel (adjust sensitivity as needed)
    // Typical gyro range is about ±32768, but we'll use a smaller range for sensitivity
    int rollDelta = map(constrain(gyroDelta, -4000, 4000), -4000, 4000, -400, 400);
    rollValue = constrain(CRSF_CHANNEL_VALUE_MID + rollDelta, 172, 1811);
  }

  // Set AUX1 value based on switch position
  uint32_t aux1Value = !aux1Switch ? 172 : 1811;  // HIGH = armed (1811), LOW = disarmed (172)
  
  // Debug output every 1000ms
  static uint32_t lastDebug = 0;
  if (millis() - lastDebug > 1000) {
    if (mpu6050Initialized) {
      int16_t currentGyroY = readMPU6050GyroY();
      DBGLN("GyroY: %d, Offset: %d, Delta: %d, Roll: %d | Thr: %d, Pitch: %d, Yaw: %d", 
            currentGyroY, gyroYOffset, currentGyroY - gyroYOffset, rollValue, throttleValue, pitchValue, yawValue);
    } else {
      DBGLN("Pot: %d->Thr: %d, JoyX: %d->Yaw: %d, JoyY: %d->Pitch: %d, AUX1: %s", 
            potValue, throttleValue, joystickX, yawValue, joystickY, pitchValue, aux1Switch ? "ARMED" : "DISARMED");
    }
    lastDebug = millis();
  }
  
  // Set channels - AETR layout (Aileron, Elevator, Throttle, Rudder)
  ChannelData[0] = rollValue;               // Roll/Aileron from gyro Y-axis
  ChannelData[1] = pitchValue;              // Pitch/Elevator from joystick Y
  ChannelData[2] = throttleValue;           // Throttle from potentiometer
  ChannelData[3] = yawValue;                // Yaw/Rudder from joystick X
  ChannelData[4] = aux1Value;               // AUX1 from toggle switch
  
  // Set remaining channels to center
  for (int i = 5; i < CRSF_NUM_CHANNELS; i++) {
    ChannelData[i] = CRSF_CHANNEL_VALUE_MID;
  }
}

// MPU6050 Functions
void initMPU6050()
{
  // Try to initialize MPU6050 with error handling
  Wire.begin(MPU6050_SDA_PIN, MPU6050_SCL_PIN);
  Wire.setClock(100000); // Set I2C clock to 100kHz (slower, more reliable)
  
  // Test communication first
  Wire.beginTransmission(MPU6050_ADDR);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    DBGLN("MPU6050 not found, gyro disabled (error: %d)", error);
    mpu6050Initialized = false;
    return;
  }
  
  // Wake up the MPU6050
  Wire.beginTransmission(MPU6050_ADDR);
  Wire.write(MPU6050_PWR_MGMT_1);
  Wire.write(0x00);
  error = Wire.endTransmission();
  
  if (error != 0) {
    DBGLN("MPU6050 wake-up failed, gyro disabled (error: %d)", error);
    mpu6050Initialized = false;
    return;
  }
  
  delay(100); // Let MPU6050 stabilize
  
  // Read initial gyro Y value for offset calibration
  gyroYOffset = readMPU6050GyroY();
  mpu6050Initialized = true;
  
  DBGLN("MPU6050 initialized successfully, gyroY offset: %d", gyroYOffset);
}

int16_t readMPU6050GyroY()
{
  if (!mpu6050Initialized) return 0;
  
  Wire.beginTransmission(MPU6050_ADDR);
  Wire.write(MPU6050_GYRO_YOUT_H);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) return 0;
  
  Wire.requestFrom(MPU6050_ADDR, 2);
  if (Wire.available() >= 2) {
    int16_t gyroY = (Wire.read() << 8) | Wire.read();
    return gyroY;
  }
  return 0;
}

// float fmap(float x, float in_min, float in_max, float out_min, float out_max) {
//     if (in_max == in_min) return out_min;  // avoid divide-by-zero
//     return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
// }

// uint32_t computeYaw(uint16_t joystickX) {
//     // 1. Normalize joystick input
//     float joyNorm = fmap((float)joystickX, 0.0f, 4095.0f, -1.0f, 1.0f);

//     // // 2. Apply deadzone
//     // const float deadzone = 0.05;  // 5% deadzone
//     // if (std::abs(joyNorm) < deadzone) {
//     //     joyNorm = 0.0;
//     // } else {
//     //     // Optional: scale remaining values to use full range after deadzone
//     //     joyNorm = (joyNorm > 0)
//     //         ? fmap(joyNorm, deadzone, 1.0, 0.0, 1.0)
//     //         : fmap(joyNorm, -deadzone, -1.0, 0.0, -1.0);
//     // }

