Pason-prsn/Project-Birdnest---ESP32-Controller/src/src/tx_main.cpp
//     // 3. Apply non-linear cubic curve
//     float curved = std::pow(joyNorm, 3);

//     // 4. Map to output range
//     float yawF = fmap(curved, -1.0, 1.0, 1811.0, 172.0);

//     return (uint32_t)lroundf(yawF);
//     // return (uint32_t)1600.5;
//     // return 1600;
// }

// uint32_t computeYaw(int joystickX) {
//     float joyNorm = fmap((float)joystickX, 0.0f, 4095.0f, -1.0f, 1.0f);
//     // float curved = std::pow(joyNorm, 3);
//     float yawF = fmap(joyNorm, -1.0f, 1.0f, 1811.0f, 172.0f);

//     // if (isnan(yawF) || isinf(yawF) || yawF < 0.0f || yawF > 3000.0f) {
//     //     Serial.println("Yaw value out of range or invalid");
//     //     return 1600;
//     // }

//     return (uint32_t)lroundf(yawF);
//     // return (uint32_t)lroundf(yawF);
// }

void setup()
{
  if (setupHardwareFromOptions())
  {
    setupTarget();
    // Register the devices with the framework
    devicesRegister(ui_devices, ARRAY_SIZE(ui_devices));
    // Initialise the devices
    devicesInit();
    DBGLN("Initialised devices");

    setupBindingFromConfig();
    FHSSrandomiseFHSSsequence(uidMacSeedGet());

    Radio.RXdoneCallback = &RXdoneISR;
    Radio.TXdoneCallback = &TXdoneISR;

    handset->registerCallbacks(UARTconnected, firmwareOptions.is_airport ? nullptr : UARTdisconnected, ModelUpdateReq, EnterBindingModeSafely);

    DBGLN("ExpressLRS TX Module Booted...");

    eeprom.Begin(); // Init the eeprom
    config.SetStorageProvider(&eeprom); // Pass pointer to the Config class for access to storage
    config.Load(); // Load the stored values from eeprom

    Radio.currFreq = FHSSgetInitialFreq(); //set frequency first or an error will occur!!!
    #if defined(RADIO_SX127X)
    //Radio.currSyncWord = UID[3];
    #endif
    bool init_success;
    #if defined(USE_BLE_JOYSTICK)
    init_success = true; // No radio is attached with a joystick only module.  So we are going to fake success so that crsf, hwTimer etc are initiated below.
    #else
    if (GPIO_PIN_SCK != UNDEF_PIN)
    {
      init_success = Radio.Begin(FHSSgetMinimumFreq(), FHSSgetMaximumFreq());
    }
    else
    {
      // Assume BLE Joystick mode if no radio SCK pin
      init_success = true;
    }
    #endif

    if (!init_success)
    {
      connectionState = radioFailed;
    }
    else
    {
      TelemetryReceiver.SetDataToReceive(CRSFinBuffer, sizeof(CRSFinBuffer));

      POWERMGNT::init();
      DynamicPower_Init();

      // Set the pkt rate, TLM ratio, and power from the stored eeprom values
      ChangeRadioParams();
      
      // Very quick standalone mode activation
      standaloneActivationTime = millis() + 50;
      
      // Initialize potentiometer, joystick pins, and AUX1 switch
      pinMode(THROTTLE_POT_PIN, INPUT);
      pinMode(JOYSTICK_X_PIN, INPUT);
      pinMode(JOYSTICK_Y_PIN, INPUT);
      pinMode(AUX1_SWITCH_PIN, INPUT_PULLUP);  // Use internal pullup for switch
      analogSetAttenuation(ADC_11db);  // Set ADC range to 0-3.3V

  #if defined(Regulatory_Domain_EU_CE_2400)
      SetClearChannelAssessmentTime();
  #endif
      hwTimer::init(nullptr, timerCallback);
      connectionState = noCrossfire;
      
      // Initialize MPU6050 after radio is set up (delay to avoid interference)
      delay(1000);
      initMPU6050();
    }
  }
  else
  {
    // In the failure case we set the logging to the null logger so nothing crashes
    // if it decides to log something
    TxBackpack = new NullStream();
  }

#if defined(HAS_BUTTON)
  registerButtonFunction(ACTION_BIND, EnterBindingMode);
  registerButtonFunction(ACTION_INCREASE_POWER, cyclePower);
#endif

  devicesStart();

  if (firmwareOptions.is_airport)
  {
    config.SetTlm(TLM_RATIO_1_2); // Force TLM ratio of 1:2 for balanced bi-dir link
    config.SetMotionMode(0); // Ensure motion detection is off
    UARTconnected();
  }
}

void loop()
{
  uint32_t now = millis();

  HandleUARTout(); // Only used for non-CRSF output

  // Check if we should activate standalone mode
  if (standaloneActivationTime != 0 && now >= standaloneActivationTime && connectionState == noCrossfire)
  {
    // Enter binding mode to establish RF connection
    DBGLN("Quick binding for standalone mode");
    EnterBindingMode();
    
    // Short binding phase - 300ms should be enough
    standaloneConnectionTime = now + 300;
    standaloneActivationTime = 0;  // Only do this once
  }
  
  // Exit binding mode and establish 250Hz connection
  if (standaloneConnectionTime != 0 && now >= standaloneConnectionTime && InBindingMode)
  {
    // Exit binding mode which will call UARTconnected() and establish normal operation
    ExitBindingMode();
    
    // Set to 250Hz after exiting binding
    config.SetRate(RATE_LORA_250HZ);
    SetRFLinkRate(RATE_LORA_250HZ);
    
    // Simulate having a model match and telemetry
    connectionHasModelMatch = true;
    LastTLMpacketRecvMillis = now;
    
    standaloneConnectionTime = 0;  // Only do this once
    DBGLN("Fast standalone 250Hz mode established");
  }

  #if defined(USE_BLE_JOYSTICK)
  if (connectionState != bleJoystick && connectionState != noCrossfire) // Wait until the correct crsf baud has been found
  {
      connectionState = bleJoystick;
  }
  #endif

  if (connectionState < MODE_STATES)
  {
    UpdateConnectDisconnectStatus();
  }

  // Update UI devices
  devicesUpdate(now);

  // Not a device because it must be run on the loop core
  checkBackpackUpdate();

  #if defined(PLATFORM_ESP8266) || defined(PLATFORM_ESP32)
    // If the reboot time is set and the current time is past the reboot time then reboot.
    if (rebootTime != 0 && now > rebootTime) {
      ESP.restart();
    }
  #endif

  executeDeferredFunction(micros());

  HandleUARTin();

  if (connectionState > MODE_STATES)
  {
    return;
  }

  CheckReadyToSend();
  CheckConfigChangePending();
  DynamicPower_Update(now);
  VtxPitmodeSwitchUpdate();

  /* Send TLM updates to handset if connected + reporting period
   * is elapsed. This keeps handset happy dispite of the telemetry ratio */
  if ((connectionState == connected) && (LastTLMpacketRecvMillis != 0) &&
      (now >= (uint32_t)(firmwareOptions.tlm_report_interval + TLMpacketReported)))
  {
    uint8_t linkStatisticsFrame[CRSF_FRAME_NOT_COUNTED_BYTES + CRSF_FRAME_SIZE(sizeof(crsfLinkStatistics_t))];

    CRSFHandset::makeLinkStatisticsPacket(linkStatisticsFrame);
    handset->sendTelemetryToTX(linkStatisticsFrame);
    sendCRSFTelemetryToBackpack(linkStatisticsFrame);
    TLMpacketReported = now;
  }

  if (TelemetryReceiver.HasFinishedData())
  {
      if (CRSFinBuffer[0] == CRSF_ADDRESS_USB)
      {
        if (config.GetLinkMode() == TX_MAVLINK_MODE)
        {
          // raw mavlink data - forward to USB rather than handset
          uint8_t count = CRSFinBuffer[1];
          // Convert to CRSF telemetry where we can
          convert_mavlink_to_crsf_telem(CRSFinBuffer, count, handset);
          TxUSB->write(CRSFinBuffer + CRSF_FRAME_NOT_COUNTED_BYTES, count);
          // If we have a backpack
          if (TxUSB != TxBackpack)
          {
            sendMAVLinkTelemetryToBackpack(CRSFinBuffer);
          }
        }
      }
      else
      {
        // Send all other tlm to handset
        handset->sendTelemetryToTX(CRSFinBuffer);
        sendCRSFTelemetryToBackpack(CRSFinBuffer);
      }
      TelemetryReceiver.Unlock();
  }

  // only send msp data when binding is not active
  static bool mspTransferActive = false;
  if (InBindingMode)
  {
#if defined(RADIO_LR1121)
    // Send half of the bind packets on the 2.4GHz domain
    if (BindingSendCount == BindingSpamAmount / 2) {
      SetRFLinkRate(RATE_DUALBAND_BINDING);
      // Increment BindingSendCount so that SetRFLinkRate is only called once.
      BindingSendCount++;
    }
#endif
    // exit bind mode if package after some repeats
    if (BindingSendCount > BindingSpamAmount) {
      ExitBindingMode();
    }
  }
  else if (!MspSender.IsActive())
  {
    // sending is done and we need to update our flag
    if (mspTransferActive)
    {
      // unlock buffer for msp messages
      CRSF::UnlockMspMessage();
      mspTransferActive = false;
    }
    // we are not sending so look for next msp package
    else
    {
      uint8_t* mspData;
      uint8_t mspLen;
      CRSF::GetMspMessage(&mspData, &mspLen);
      // if we have a new msp package start sending
      if (mspData != nullptr)
      {
        MspSender.SetDataToTransmit(mspData, mspLen);
        mspTransferActive = true;
      }
    }
  }

  if (config.GetLinkMode() == TX_MAVLINK_MODE)
  {
    // Use MspSender for MAVLINK uplink data
    uint8_t *nextPayload = 0;
    uint8_t nextPlayloadSize = 0;
    uint16_t count = uartInputBuffer.size();
    if (count > 0 && !MspSender.IsActive())
    {
        count = std::min(count, (uint16_t)CRSF_PAYLOAD_SIZE_MAX);
        mavlinkSSBuffer[0] = MSP_ELRS_MAVLINK_TLM; // Used on RX to differentiate between std msp opcodes and mavlink
        mavlinkSSBuffer[1] = count;
        // Following n bytes are just raw mavlink
        uartInputBuffer.lock();
        uartInputBuffer.popBytes(mavlinkSSBuffer + CRSF_FRAME_NOT_COUNTED_BYTES, count);
        uartInputBuffer.unlock();
        nextPayload = mavlinkSSBuffer;
        nextPlayloadSize = count + CRSF_FRAME_NOT_COUNTED_BYTES;
        MspSender.SetDataToTransmit(nextPayload, nextPlayloadSize);
    }
  }
}
